casapudenis/CY8CKIT-062-BLE/CE222221_Voice_Recorder01/CE222221_Voice_Recorder01.cydsn/Generated_Source/PSoC6/DMA_PlayRight.h
/***************************************************************************//**
* \file DMA_PlayRight.h
* \version 2.0
*
*  This file provides constants, parameter values and API definition for the
*  DMA_PlayRight Component.
*
********************************************************************************
* \copyright
* Copyright 2016-2017, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(DMA_PlayRight_CH_H)
#define DMA_PlayRight_CH_H

#include "cy_device_headers.h"
#include "cyfitter.h"
#include "dma/cy_dma.h"
#include "trigmux/cy_trigmux.h"

#if defined(__cplusplus)
extern "C" {
#endif

#define DMA_PlayRight_DW_BLOCK       (0u)
#define DMA_PlayRight_DW_CHANNEL     (0u)
#define DMA_PlayRight_HW             (DW0)
#define DMA_PlayRight_INTR_MASK      (CY_DMA_INTR_MASK)

/* Channel settings */
#define DMA_PlayRight_PRIORITY       (3u)
#define DMA_PlayRight_DESCRIPTOR_NUM (1u)
#define DMA_PlayRight_PREEMPTABLE    (false)
#define DMA_PlayRight_BUFFERABLE     (false)

/***************************************
*        Function Prototypes
***************************************/

                void DMA_PlayRight_Start(void const * srcAddress, void const * dstAddress);
__STATIC_INLINE void DMA_PlayRight_Stop(void);
                void DMA_PlayRight_Init(void);
__STATIC_INLINE void DMA_PlayRight_ChannelEnable(void);
__STATIC_INLINE void DMA_PlayRight_ChannelDisable(void);

__STATIC_INLINE void DMA_PlayRight_SetDescriptor       (cy_stc_dma_descriptor_t const * descriptor);
__STATIC_INLINE void DMA_PlayRight_SetNextDescriptor   (cy_stc_dma_descriptor_t const * descriptor);
__STATIC_INLINE void DMA_PlayRight_SetPriority         (uint32_t priority);
__STATIC_INLINE void DMA_PlayRight_SetSrcAddress       (cy_stc_dma_descriptor_t * descriptor, void const * srcAddress);
__STATIC_INLINE void DMA_PlayRight_SetDstAddress       (cy_stc_dma_descriptor_t * descriptor, void const * dstAddress);
__STATIC_INLINE void DMA_PlayRight_SetXloopDataCount   (cy_stc_dma_descriptor_t * descriptor, uint32_t xCount);
__STATIC_INLINE void DMA_PlayRight_SetYloopDataCount   (cy_stc_dma_descriptor_t * descriptor, uint32_t yCount);
__STATIC_INLINE void DMA_PlayRight_SetXloopSrcIncrement(cy_stc_dma_descriptor_t * descriptor, int32_t srcXincrement);
__STATIC_INLINE void DMA_PlayRight_SetXloopDstIncrement(cy_stc_dma_descriptor_t * descriptor, int32_t dstXincrement);
__STATIC_INLINE void DMA_PlayRight_SetYloopSrcIncrement(cy_stc_dma_descriptor_t * descriptor, int32_t srcYincrement);
__STATIC_INLINE void DMA_PlayRight_SetYloopDstIncrement(cy_stc_dma_descriptor_t * descriptor, int32_t dstYincrement);
__STATIC_INLINE void DMA_PlayRight_SetInterruptType    (cy_stc_dma_descriptor_t * descriptor, cy_en_dma_trigger_type_t interruptType);
__STATIC_INLINE void DMA_PlayRight_SetTriggerInType    (cy_stc_dma_descriptor_t * descriptor, cy_en_dma_trigger_type_t triggerInType);
__STATIC_INLINE void DMA_PlayRight_SetTriggerOutType   (cy_stc_dma_descriptor_t * descriptor, cy_en_dma_trigger_type_t triggerOutType);
__STATIC_INLINE void DMA_PlayRight_SetDataSize         (cy_stc_dma_descriptor_t * descriptor, cy_en_dma_data_size_t dataSize);
__STATIC_INLINE void DMA_PlayRight_SetSrcTransferSize  (cy_stc_dma_descriptor_t * descriptor, cy_en_dma_transfer_size_t srcTransferSize);
__STATIC_INLINE void DMA_PlayRight_SetDstTransferSize  (cy_stc_dma_descriptor_t * descriptor, cy_en_dma_transfer_size_t dstTransferSize);
__STATIC_INLINE void DMA_PlayRight_SetRetrigger        (cy_stc_dma_descriptor_t * descriptor, cy_en_dma_retrigger_t retrigger);
__STATIC_INLINE void DMA_PlayRight_SetDescriptorType   (cy_stc_dma_descriptor_t * descriptor, cy_en_dma_descriptor_type_t descriptorType);
__STATIC_INLINE void DMA_PlayRight_SetChannelState     (cy_stc_dma_descriptor_t * descriptor, cy_en_dma_channel_state_t channelState);

__STATIC_INLINE cy_stc_dma_descriptor_t *   DMA_PlayRight_GetDescriptor(void);
__STATIC_INLINE cy_stc_dma_descriptor_t *   DMA_PlayRight_GetNextDescriptor(void);
__STATIC_INLINE uint32_t                    DMA_PlayRight_GetPriority(void);
__STATIC_INLINE cy_en_dma_intr_cause_t      DMA_PlayRight_GetStatus(void);
__STATIC_INLINE cy_en_trigmux_status_t      DMA_PlayRight_Trigger(uint32_t cycles);
__STATIC_INLINE void *                      DMA_PlayRight_GetSrcAddress       (cy_stc_dma_descriptor_t const * descriptor);
__STATIC_INLINE void *                      DMA_PlayRight_GetDstAddress       (cy_stc_dma_descriptor_t const * descriptor);
__STATIC_INLINE uint32_t                    DMA_PlayRight_GetXloopDataCount   (cy_stc_dma_descriptor_t const * descriptor);
__STATIC_INLINE uint32_t                    DMA_PlayRight_GetYloopDataCount   (cy_stc_dma_descriptor_t const * descriptor);
__STATIC_INLINE int32_t                     DMA_PlayRight_GetXloopSrcIncrement(cy_stc_dma_descriptor_t const * descriptor);
__STATIC_INLINE int32_t                     DMA_PlayRight_GetXloopDstIncrement(cy_stc_dma_descriptor_t const * descriptor);
__STATIC_INLINE int32_t                     DMA_PlayRight_GetYloopSrcIncrement(cy_stc_dma_descriptor_t const * descriptor);
__STATIC_INLINE int32_t                     DMA_PlayRight_GetYloopDstIncrement(cy_stc_dma_descriptor_t const * descriptor);
__STATIC_INLINE cy_en_dma_trigger_type_t    DMA_PlayRight_GetInterruptType    (cy_stc_dma_descriptor_t const * descriptor);
__STATIC_INLINE cy_en_dma_trigger_type_t    DMA_PlayRight_GetTriggerInType    (cy_stc_dma_descriptor_t const * descriptor);
__STATIC_INLINE cy_en_dma_trigger_type_t    DMA_PlayRight_GetTriggerOutType   (cy_stc_dma_descriptor_t const * descriptor);
__STATIC_INLINE cy_en_dma_data_size_t       DMA_PlayRight_GetDataSize         (cy_stc_dma_descriptor_t const * descriptor);
__STATIC_INLINE cy_en_dma_transfer_size_t   DMA_PlayRight_GetSrcTransferSize  (cy_stc_dma_descriptor_t const * descriptor);
__STATIC_INLINE cy_en_dma_transfer_size_t   DMA_PlayRight_GetDstTransferSize  (cy_stc_dma_descriptor_t const * descriptor);
__STATIC_INLINE cy_en_dma_retrigger_t       DMA_PlayRight_GetRetrigger        (cy_stc_dma_descriptor_t const * descriptor);
__STATIC_INLINE cy_en_dma_descriptor_type_t DMA_PlayRight_GetDescriptorType   (cy_stc_dma_descriptor_t const * descriptor);
__STATIC_INLINE cy_en_dma_channel_state_t   DMA_PlayRight_GetChannelState     (cy_stc_dma_descriptor_t const * descriptor);

__STATIC_INLINE uint32_t DMA_PlayRight_GetInterruptStatus(void);
__STATIC_INLINE void     DMA_PlayRight_ClearInterrupt(void);
__STATIC_INLINE void     DMA_PlayRight_SetInterrupt(void);
__STATIC_INLINE uint32_t DMA_PlayRight_GetInterruptMask(void);
__STATIC_INLINE void     DMA_PlayRight_SetInterruptMask(uint32_t interrupt);
__STATIC_INLINE uint32_t DMA_PlayRight_GetInterruptStatusMasked(void);


