casapudenis/CY8CKIT-062-BLE/CE222221_Voice_Recorder01/CE222221_Voice_Recorder01.cydsn/Generated_Source/PSoC6/DMA_PlayRight.h
/***************************************
*    Global Variables
***************************************/
extern uint8_t DMA_PlayRight_initVar;

extern const cy_stc_dma_descriptor_config_t DMA_PlayRight_SRAM_to_I2S_config;
extern cy_stc_dma_descriptor_t DMA_PlayRight_SRAM_to_I2S;



/***************************************
*    In-line Function Implementation
***************************************/

/*******************************************************************************
* Function Name: DMA_PlayRight_Stop
****************************************************************************//**
* Invokes the Cy_DMA_Channel_Disable() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE void DMA_PlayRight_Stop(void)
{
    Cy_DMA_Channel_Disable(DMA_PlayRight_HW, DMA_PlayRight_DW_CHANNEL);
}


/*******************************************************************************
* Function Name: DMA_PlayRight_ChannelEnable
****************************************************************************//**
* Invokes the Cy_DMA_Channel_Enable() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE void DMA_PlayRight_ChannelEnable(void)
{
    Cy_DMA_Channel_Enable(DMA_PlayRight_HW, DMA_PlayRight_DW_CHANNEL);
}


/*******************************************************************************
* Function Name: DMA_PlayRight_ChannelDisable
****************************************************************************//**
* Invokes the Cy_DMA_Channel_Disable() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE void DMA_PlayRight_ChannelDisable(void)
{
    Cy_DMA_Channel_Disable(DMA_PlayRight_HW, DMA_PlayRight_DW_CHANNEL);
}


/*******************************************************************************
* Function Name: DMA_PlayRight_SetDescriptor
****************************************************************************//**
* Invokes the Cy_DMA_Channel_SetDescriptor() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE void DMA_PlayRight_SetDescriptor(cy_stc_dma_descriptor_t const * descriptor)
{
    Cy_DMA_Channel_SetDescriptor(DMA_PlayRight_HW, DMA_PlayRight_DW_CHANNEL, descriptor);
}


/*******************************************************************************
* Function Name: DMA_PlayRight_GetDescriptor
****************************************************************************//**
* Invokes the Cy_DMA_Channel_GetCurrentDescriptor() PDL driver function.
*******************************************************************************/
__STATIC_INLINE cy_stc_dma_descriptor_t * DMA_PlayRight_GetDescriptor(void)
{
    return(Cy_DMA_Channel_GetCurrentDescriptor(DMA_PlayRight_HW, DMA_PlayRight_DW_CHANNEL));
}


/*******************************************************************************
* Function Name: DMA_PlayRight_SetNextDescriptor
****************************************************************************//**
* Invokes the Cy_DMA_Descriptor_SetNextDescriptor() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE void DMA_PlayRight_SetNextDescriptor(cy_stc_dma_descriptor_t const * descriptor)
{
    Cy_DMA_Descriptor_SetNextDescriptor(Cy_DMA_Channel_GetCurrentDescriptor(DMA_PlayRight_HW, DMA_PlayRight_DW_CHANNEL), descriptor);
}


/*******************************************************************************
* Function Name: DMA_PlayRight_GetNextDescriptor
****************************************************************************//**
* Invokes the Cy_DMA_Descriptor_GetNextDescriptor() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE cy_stc_dma_descriptor_t * DMA_PlayRight_GetNextDescriptor(void)
{
    return(Cy_DMA_Descriptor_GetNextDescriptor(Cy_DMA_Channel_GetCurrentDescriptor(DMA_PlayRight_HW, DMA_PlayRight_DW_CHANNEL)));
}


/*******************************************************************************
* Function Name: DMA_PlayRight_SetPriority
****************************************************************************//**
* Invokes the Cy_DMA_Channel_SetPriority() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE void DMA_PlayRight_SetPriority(uint32_t priority)
{
    Cy_DMA_Channel_SetPriority(DMA_PlayRight_HW, DMA_PlayRight_DW_CHANNEL, priority);
}


/*******************************************************************************
* Function Name: DMA_PlayRight_GetPriority
****************************************************************************//**
* Invokes the Cy_DMA_Channel_GetPriority() PDL driver function.  
*******************************************************************************/
__STATIC_INLINE uint32_t DMA_PlayRight_GetPriority(void)
{
    return (Cy_DMA_Channel_GetPriority(DMA_PlayRight_HW, DMA_PlayRight_DW_CHANNEL));
}


/*******************************************************************************
* Function Name: DMA_PlayRight_SetSrcAddress
****************************************************************************//**
* Invokes the Cy_DMA_Descriptor_SetSrcAddress() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE void DMA_PlayRight_SetSrcAddress(cy_stc_dma_descriptor_t * descriptor, void const * srcAddress)
{
    Cy_DMA_Descriptor_SetSrcAddress(descriptor, srcAddress);
}


/*******************************************************************************
* Function Name: DMA_PlayRight_GetSrcAddress
****************************************************************************//**
* Invokes the Cy_DMA_Descriptor_GetSrcAddress() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE void * DMA_PlayRight_GetSrcAddress(cy_stc_dma_descriptor_t const * descriptor)
{
    return(Cy_DMA_Descriptor_GetSrcAddress(descriptor));
}


