casapudenis/CY8CKIT-062-BLE/CE222221_Voice_Recorder01/CE222221_Voice_Recorder01.cydsn/Generated_Source/PSoC6/DMA_PlayRight.h
/*******************************************************************************
* Function Name: DMA_PlayRight_GetStatus
****************************************************************************//**
* Invokes the Cy_DMA_Channel_GetStatus() PDL driver function.
*******************************************************************************/
__STATIC_INLINE cy_en_dma_intr_cause_t DMA_PlayRight_GetStatus(void)
{
    return (Cy_DMA_Channel_GetStatus(DMA_PlayRight_HW, DMA_PlayRight_DW_CHANNEL));
}


/*******************************************************************************
* Function Name: DMA_PlayRight_ClearInterrupt
****************************************************************************//**
* Invokes the Cy_DMA_Channel_ClearInterrupt() PDL driver function.
*******************************************************************************/
__STATIC_INLINE void DMA_PlayRight_ClearInterrupt(void)
{
    Cy_DMA_Channel_ClearInterrupt(DMA_PlayRight_HW, DMA_PlayRight_DW_CHANNEL);
}


/*******************************************************************************
* Function Name: DMA_PlayRight_SetInterrupt
****************************************************************************//**
* Invokes the Cy_DMA_Channel_SetInterrupt() PDL driver function.
*******************************************************************************/
__STATIC_INLINE void DMA_PlayRight_SetInterrupt(void)
{
    Cy_DMA_Channel_SetInterrupt(DMA_PlayRight_HW, DMA_PlayRight_DW_CHANNEL);
}


/*******************************************************************************
* Function Name: DMA_PlayRight_GetInterruptMask
****************************************************************************//**
* Invokes the Cy_DMA_Channel_GetInterruptMask() PDL driver function.
*******************************************************************************/
__STATIC_INLINE uint32_t DMA_PlayRight_GetInterruptMask(void)
{
    return (Cy_DMA_Channel_GetInterruptMask(DMA_PlayRight_HW, DMA_PlayRight_DW_CHANNEL));
}


/*******************************************************************************
* Function Name: DMA_PlayRight_SetInterruptMask
****************************************************************************//**
* Invokes the Cy_DMA_Channel_SetInterruptMask() PDL driver function.
*******************************************************************************/
__STATIC_INLINE void DMA_PlayRight_SetInterruptMask(uint32_t interrupt)
{
    Cy_DMA_Channel_SetInterruptMask(DMA_PlayRight_HW, DMA_PlayRight_DW_CHANNEL, interrupt);
}


/*******************************************************************************
* Function Name: DMA_PlayRight_GetInterruptStatusMasked
****************************************************************************//**
* Invokes the Cy_DMA_Channel_GetInterruptStatusMasked() PDL driver function.
*******************************************************************************/
__STATIC_INLINE uint32_t DMA_PlayRight_GetInterruptStatusMasked(void)
{
    return (Cy_DMA_Channel_GetInterruptStatusMasked(DMA_PlayRight_HW, DMA_PlayRight_DW_CHANNEL));
}


/*******************************************************************************
* Function Name: DMA_PlayRight_Trigger
****************************************************************************//**
*
* Invokes the Cy_TrigMux_SwTrigger() PDL driver function.
*
* \param cycles
*  The number of "Clk_Peri" cycles during which the trigger remains activated.
*  The valid range of cycles is 1 ... 254.
*  Also there are special values:
*  CY_TRIGGER_INFINITE - trigger remains activated untill user deactivates it by
*  calling this function with CY_TRIGGER_DEACTIVATE parameter.
*  CY_TRIGGER_DEACTIVATE - it is used to deactivate the trigger activated by
*  calling this function with CY_TRIGGER_INFINITE parameter.
*  Note: the DMA is clocked by "Clk_Slow" which can be slower than "Clk_Peri".
* 
* \return A status:
* - CY_TRIGMUX_SUCCESS: The trigger is succesfully activated/deactivated.
* - CY_TRIGMUX_INVALID_STATE: The trigger is already activated/not active.
*
*******************************************************************************/
__STATIC_INLINE cy_en_trigmux_status_t DMA_PlayRight_Trigger(uint32_t cycles)
{
    return (Cy_TrigMux_SwTrigger((uint32_t)DMA_PlayRight_DW__TR_IN, cycles));
}


#if(CY_DMA_BWC)
/* Definitions to support backward compatibility with the component version 1.0, 
*  they are strongly not recommended to use in new designs */

#define DMA_PlayRight_ChEnable                (DMA_PlayRight_ChannelEnable)
#define DMA_PlayRight_ChDisable               (DMA_PlayRight_ChannelDisable)
#define DMA_PlayRight_SetDataElementSize      (DMA_PlayRight_SetDataSize)
#define DMA_PlayRight_GetDataElementSize      (DMA_PlayRight_GetDataSize)
#define DMA_PlayRight_SetXloopNumDataElements (DMA_PlayRight_SetXloopDataCount)
#define DMA_PlayRight_GetXloopNumDataElements (DMA_PlayRight_GetXloopDataCount)
#define DMA_PlayRight_SetYloopNumDataElements (DMA_PlayRight_SetYloopDataCount)
#define DMA_PlayRight_GetYloopNumDataElements (DMA_PlayRight_GetYloopDataCount)
#define DMA_PlayRight_SetInterruptMask()      (DMA_PlayRight_SetInterruptMask(DMA_PlayRight_INTR_MASK))
#define DMA_PlayRight_GetInterruptCause       (DMA_PlayRight_GetStatus)

#define DMA_PlayRight_PREEMTAMBLE             (DMA_PlayRight_PREEMPTABLE)
/*******************************************************************************
* Function Name: DMA_PlayRight_SetSrcDstTransferWidth
****************************************************************************//**
* This is a legacy API function, it is left here just for backward compatibility
*******************************************************************************/
__STATIC_INLINE void DMA_PlayRight_SetSrcDstTransferWidth(cy_stc_dma_descriptor_t * descriptor, uint32_t options)
{
    uint32_t ctlRegVal = descriptor->ctl & ((uint32_t)~(DW_DESCR_STRUCT_DESCR_CTL_SRC_TRANSFER_SIZE_Msk | \
            DW_DESCR_STRUCT_DESCR_CTL_DST_TRANSFER_SIZE_Msk));
    
    descriptor->ctl = ctlRegVal |
        ((options << DW_DESCR_STRUCT_DESCR_CTL_SRC_TRANSFER_SIZE_Pos) &
        (DW_DESCR_STRUCT_DESCR_CTL_SRC_TRANSFER_SIZE_Msk | DW_DESCR_STRUCT_DESCR_CTL_DST_TRANSFER_SIZE_Msk));
}


/*******************************************************************************
* Function Name: DMA_1_GetSrcDstTransferWidth
****************************************************************************//**
* This is a legacy API function, it is left here just for backward compatibility
*******************************************************************************/
__STATIC_INLINE uint32_t DMA_PlayRight_GetSrcDstTransferWidth(cy_stc_dma_descriptor_t const * descriptor)
{
    uint32_t ctlRegVal = descriptor->ctl & (DW_DESCR_STRUCT_DESCR_CTL_SRC_TRANSFER_SIZE_Msk |
        DW_DESCR_STRUCT_DESCR_CTL_DST_TRANSFER_SIZE_Msk);
    
    return(ctlRegVal >> DW_DESCR_STRUCT_DESCR_CTL_SRC_TRANSFER_SIZE_Pos);
}

#endif /* CY_DMA_BWC */


#if defined(__cplusplus)
}
#endif

#endif/* (DMA_PlayRight_CH_H) */

/* [] END OF FILE */
